{
  "name": "Spellcasting",
  "type": "feat",
  "img": "icons/commodities/tech/tube-chamber-lightning.webp",
  "system": {
    "description": {
      "value": "<p><em>1st-level artificer feature</em></p><p>You have learned how to channel magical energy through objects. See the Player’s Handbook for the rules on spellcasting. The information below details how you use those rules with Artificer spells, which appear in the Artificer spell list later in the class’s description.</p><p>@UUID[Compendium.katozu-5e.rules.JournalEntry.C5OeKSkcM954tiox.JournalEntryPage.1sNuNp7poxpXT2Fr]{Artificer spell list}</p><h5>Tools Required</h5><p>You produce your Artificer spells through tools. You can use @UUID[Compendium.dnd5e.equipment24.Item.phbtulThievesToo]{Thieves' Tools}, @UUID[Compendium.dnd5e.equipment24.Item.phbtulTinkersToo]{Tinker's Tools}, or another kind of Artisan’s Tools with which you have proficiency as a Spellcasting Focus, and you must have one of those focuses in hand when you cast an Artificer spell (meaning the spell has an “M” component when you cast it).</p><h5>Cantrips</h5><p>You know two Artificer cantrips of your choice. Acid Splash and Prestidigitation are recommended.</p><p>Whenever you finish a Long Rest, you can replace one of your cantrips from this feature with another Artificer cantrip of your choice.</p><p>When you reach Artificer levels 10 and 14, you learn another Artificer cantrip of your choice, as shown in the Cantrips column of the Artificer Features table.</p><h5>Spell Slots</h5><p>The Artificer Features table shows how many spell slots you have to cast your level 1+ spells. You regain all expended spell slots when you finish a Long Rest.</p><h5>Prepared Spells of Level 1+.</h5><p>You prepare the list of level 1+ spells that are available for you to cast with this feature. To start, choose two level 1 Artificer spells. Cure Wounds and Grease are recommended.</p><p>The number of spells on your list increases as you gain Artificer levels, as shown in the Prepared Spells column of the Artificer Features table. Whenever that number increases, choose additional Artificer spells until the number of spells on your list matches the number on the table. The chosen spells must be of a level for which you have spell slots. For example, if you’re a level 5 Artificer, your list of prepared spells can include six Artificer spells of levels 1 and 2 in any combination.</p><p>If another Artificer feature gives you spells that you always have prepared, those don’t count against the number of spells you can prepare with this feature, but those spells otherwise count as Artificer spells for you.</p><h5>Changing Your Prepared Spells. Whenever</h5><p>you finish a Long Rest, you can change your list of prepared spells, replacing any of the spells there with other Artificer spells for which you have spell slots.</p><h5>Spellcasting Ability</h5><p>Intelligence is your spellcasting ability for your Artificer spells.</p><p><strong>Spell save DC</strong> = 8 + your proficiency bonus + your Intelligence modifier</p><p><strong>Spell attack modifier</strong> = your proficiency bonus + your Intelligence modifier</p>",
      "chat": ""
    },
    "source": {
      "revision": 1,
      "rules": "2024"
    },
    "cover": null,
    "crewed": false,
    "uses": {
      "max": "",
      "spent": 0,
      "recovery": []
    },
    "type": {
      "value": "class",
      "subtype": ""
    },
    "properties": [],
    "requirements": "Artificer 1",
    "prerequisites": {
      "level": 1,
      "repeatable": false
    },
    "activities": {},
    "identifier": "spellcasting",
    "advancement": [],
    "enchant": {}
  },
  "effects": [],
  "folder": "PEwryi2rV2i1mvwb",
  "flags": {},
  "_stats": {
    "compendiumSource": null,
    "duplicateSource": null,
    "exportSource": null,
    "coreVersion": "13.346",
    "systemId": "dnd5e",
    "systemVersion": "5.0.4",
    "createdTime": 1752846510727,
    "modifiedTime": 1752853294166,
    "lastModifiedBy": "yrdKzgXfXHeAwF97"
  },
  "_id": "Al5NEtfmsSlHyhGY",
  "sort": 200000,
  "ownership": {
    "default": 0,
    "yrdKzgXfXHeAwF97": 3
  },
  "_key": "!items!Al5NEtfmsSlHyhGY"
}
